# Основы pandas

In [1]:
import pandas as pd

Пример забора данных с сайтов

In [7]:
pd.read_html('http://www.cbr.ru')[0]

             0             1             2
0  Курсы валют  с 12.08.2020  с 13.08.2020
1   Доллар США      73,1522₽      73,2351₽
2         Евро      85,9246₽      85,9560₽

In [3]:
page_url = 'https://www.finanz.ru/valyuty/usd-rub'

# Импортируем нужную нам страницу в df
# attrs = {'class': 'news_table'} ---> указываем какой именно блок нам нужен
# encoding='utf-8' ---> указываем кодировку страниц для корректного отображения кириллицы
df = pd.read_html(page_url, attrs = {'class': 'news_table'}, encoding='utf-8')

In [4]:
df[:5]

[          0         1         2         3        4
 0      Дата  Закрытие  Открытие  Максимум  Минимум
 1  11.08.20    731568    735707    736545   726885
 2  10.08.20    735445    734335    740150   731835
 3  09.08.20    734770    737165    738935   734480
 4  07.08.20    737500    733024    739250   731680
 5  06.08.20    733785    729100    736140   726695
 6  05.08.20    729090    733841    735646   726350
 7  04.08.20    733840    730965    740300   729157
 8  03.08.20    730952    741285    746085   730500
 9  02.08.20    741490    742570    743745   741180,
          0   1       2       3                    4
 0      Имя NaN       %    курс                 Дата
 1  EUR/RUB NaN   05913  864185  12.08.2020 16:08:00
 2  USD/RUB NaN   01479   73265  12.08.2020 16:08:00
 3  CHF/RUB NaN   07703  803929  12.08.2020 16:08:00
 4  JPY/RUB NaN  -00692   06863  12.08.2020 16:09:00
 5  GBP/RUB NaN   00368   95534  12.08.2020 16:09:00
 6  NOK/RUB NaN   08942   81984  12.08.2020 16:08:00
 7  AUD/RUB NaN   02819  524105  12.08.2020 16:08:00
 8  NZD/RUB NaN     011  481462  12.08.2020 16:08:00
 9  TRY/RUB NaN  -04553  100443  12.08.2020 16:08:00]

Импорт данных из файла

In [8]:
data = pd.read_csv('power.csv')
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [9]:
data.tail()

          country  year  quantity  category
1189477  Viet Nam  2012      92.0        71
1189478  Viet Nam  2011      87.0        71
1189479  Viet Nam  2010      50.0        71
1189480  Viet Nam  2009      10.0        71
1189481  Viet Nam  2008       1.0        71

In [10]:
type(data)

pandas.core.frame.DataFrame

In [ ]:
# если надо указать свои заголовки и разделитель
# data = pd.read_csv('power.csv', names = ['страна', 'год', 'количество', 'категория'], sep = '\t', header=0)
# data.head()

In [11]:
# количество строк в датафрейме

len(data)

1189482

In [ ]:
# или так

data.shape

Простые вычисления для нового столбца

In [ ]:
data['year_plus_one'] = data['year'] + 1
data.head()

### Упражнение
Вам дана статистика продаж в файле transactions.csv. Вам необходимо загрузить этот файл в датафрейм и посчитать его размеры.

In [12]:
data_tr = pd.read_csv('transactions.csv')
data_tr.head()

   Year  Month    ID Product  Amount  Price  Total  Cost
0  2017      1  t001      A1       7   2904  20328  1200
1  2017      1  t002      A2       2   1896   3792  1100
2  2017      2  t003      A1       5   2904  14520  1200
3  2017      2  t004      A4       1   8618   8618  4200
4  2017      2  t005      A5       3   5175  15525   500

In [13]:
data_tr.shape

(60, 8)

In [14]:
data_tr.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 60 entries, 0 to 59
Data columns (total 8 columns):
Year       60 non-null int64
Month      60 non-null int64
ID         60 non-null object
Product    60 non-null object
Amount     60 non-null int64
Price      60 non-null int64
Total      60 non-null int64
Cost       60 non-null int64
dtypes: int64(6), object(2)
memory usage: 3.8+ KB

### Основные сведения о датафрейме

In [15]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1189482 entries, 0 to 1189481
Data columns (total 4 columns):
country     1189482 non-null object
year        1189482 non-null int64
quantity    1189482 non-null float64
category    1189482 non-null int64
dtypes: float64(1), int64(2), object(1)
memory usage: 36.3+ MB

In [16]:
# немного статистики

data.describe()

               year      quantity      category
count  1.189482e+06  1.189482e+06  1.189482e+06
mean   2.002852e+03  1.842648e+05  3.624763e+01
std    7.167345e+00  1.585663e+07  1.809968e+01
min    1.990000e+03 -8.643480e+05  1.000000e+00
25%    1.997000e+03  1.400000e+01  2.400000e+01
50%    2.003000e+03  1.890000e+02  3.500000e+01
75%    2.009000e+03  2.265000e+03  5.100000e+01
max    2.014000e+03  6.680329e+09  7.100000e+01

### Отдельный столбец (тип Series)

In [17]:
data['year'].head()

0    1996
1    1995
2    2014
3    2013
4    2012
Name: year, dtype: int64

In [ ]:
# или так

data.year.head()

In [ ]:
type(data['year'])

In [ ]:
data.head()

In [ ]:
# уникальные значения в столбце

data['category'].unique()

In [ ]:
len(data['category'].unique())

In [ ]:
data['category'].head()

In [18]:
# распределение количества строк по значениям столбца

data['category'].value_counts().head(10)

67    133916
27     97645
24     75132
42     64161
37     62156
39     53198
25     52032
21     50229
51     43466
31     42307
Name: category, dtype: int64

In [19]:
data['category'].value_counts(normalize=True).head()

67    0.112583
27    0.082090
24    0.063164
42    0.053940
37    0.052255
Name: category, dtype: float64

### Упражнение
Используем файл transactions.csv. Определите какой товар (столбец Product) упоминается в файле чаще всего?

In [20]:
data_tr.head()

   Year  Month    ID Product  Amount  Price  Total  Cost
0  2017      1  t001      A1       7   2904  20328  1200
1  2017      1  t002      A2       2   1896   3792  1100
2  2017      2  t003      A1       5   2904  14520  1200
3  2017      2  t004      A4       1   8618   8618  4200
4  2017      2  t005      A5       3   5175  15525   500

In [24]:
data_tr['Product'].value_counts()

_5    11
_8     8
_2     8
_4     7
_3     7
A1     5
A4     5
A5     5
A2     2
_6     2
Name: Product, dtype: int64

# Фильтры

In [25]:
data = pd.read_csv('power.csv')
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [26]:
# выбрать несколько столбцов

country_stats = data.filter(items = ['country', 'quantity'])
country_stats.head()

   country  quantity
0  Austria       5.0
1  Austria      17.0
2  Belgium       0.0
3  Belgium       0.0
4  Belgium      35.0

In [ ]:
# или так

data[['country', 'quantity']].head()

### Отфильтруем строки с потреблением выше среднего

In [ ]:
average_level = data['quantity'].mean()
average_level

In [ ]:
'quantity > {}'.format(average_level)

In [ ]:
# строки с потреблением больше среднего

average_level = data['quantity'].mean()
country_stats.query('quantity > {}'.format(average_level)).head()

In [ ]:
# самый популярный способ

data[ data.quantity > average_level ].head()

### Как определить используемый вариант названия страны?

In [ ]:
data['country'].unique()

In [ ]:
# найдем как называется Россия и Беларусь в этом датафрейме
# фильтр на подстроку - смотрим все страны, содержащие в названии 'us'

data[ data['country'].str.contains('us', case=False) ]['country'].unique()

In [ ]:
# фильтр на несколько условий сразу
# | - условие ИЛИ
# & AND
# () | (() | () & ())
filtered_countries = data[ (data['country']=='Russian Federation') | (data['country']=='Belarus') ]

filtered_countries.head()

In [ ]:
filtered_countries['country'].unique()

In [ ]:
# фильтры на номер строки

data.loc[1000:1005]

# Сортировка

In [27]:
# Сортировка по столбцу

data.sort_values(by='quantity').head()

              country  year  quantity  category
832375  United States  2000 -864348.0        42
832373  United States  2002 -562414.0        42
832362  United States  2013 -551490.0        42
832380  United States  1995 -493380.0        42
832322        Ukraine  2010 -477263.0        42

In [28]:
# сортировка по убыванию

data.sort_values('quantity', ascending=False).head()

              country  year      quantity  category
492581  United States  2014  6.680329e+09        31
492267  United States  2014  6.680329e+09        31
492047          China  2014  5.462672e+09        31
492345          China  2014  5.462672e+09        31
122392  USSR (former)  1990  3.257000e+09        12

In [30]:
# сортировка по нескольким столбцам

data.sort_values(by=['year', 'country', 'quantity'], ascending=[True, True, False]).head(20)

             country  year     quantity  category
835137   Afghanistan  1990  3902100.000        42
492297   Afghanistan  1990   512000.000        31
491412   Afghanistan  1990   400000.000        31
492006   Afghanistan  1990   112000.000        31
491548   Afghanistan  1990    66000.000        31
820588   Afghanistan  1990     8897.000        42
791325   Afghanistan  1990     8167.000        42
797903   Afghanistan  1990     8167.000        42
811517   Afghanistan  1990     8167.000        42
813907   Afghanistan  1990     8167.000        42
828414   Afghanistan  1990     8167.000        42
832417   Afghanistan  1990     8167.000        42
1102827  Afghanistan  1990     1128.000        67
1097295  Afghanistan  1990     1055.000        67
1116195  Afghanistan  1990     1055.000        67
1137192  Afghanistan  1990      814.000        67
563395   Afghanistan  1990      764.000        33
1161814  Afghanistan  1990      740.000        67
364504   Afghanistan  1990      691.216        25
369529   Afghanistan  1990      691.216        25

### Параметр inplace

In [31]:
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [ ]:
data = data.sort_values(by=['country', 'year', 'quantity'], ascending=[True, True, False])

# чтобы сократить это выражение используем inplace:
#   сразу перезаписывает результаты в тот же самый дата сет
data.sort_values(by=['country', 'year', 'quantity'], ascending=[True, True, False], inplace=True)

### Упражнение
Используем transactions.csv.

Для какой транзакции (столбец ID) были наибольшие расходы (столбец Cost) в категории "_8" (столбец Product)?

In [33]:
data_tr.head()

   Year  Month    ID Product  Amount  Price  Total  Cost
0  2017      1  t001      A1       7   2904  20328  1200
1  2017      1  t002      A2       2   1896   3792  1100
2  2017      2  t003      A1       5   2904  14520  1200
3  2017      2  t004      A4       1   8618   8618  4200
4  2017      2  t005      A5       3   5175  15525   500

In [35]:
data = data_tr[ (data_tr['Product']=='_8')]
data.head()

    Year  Month    ID Product  Amount  Price  Total  Cost
8   2017      4  t009      _8       3   3760  11280  1000
12  2017      4  t013      _8       3   3760  11280  1200
22  2017      6  t023      _8      10   3760  37600   200
26  2017      6  t027      _8       3   3760  11280   800
37  2017      9  t038      _8       1   3760   3760   700

In [42]:
data.sort_values(by=['Cost'], ascending=[False]).head()

    Year  Month    ID Product  Amount  Price  Total  Cost
54  2017     12  t055      _8       2   3760   7520  2400
12  2017      4  t013      _8       3   3760  11280  1200
8   2017      4  t009      _8       3   3760  11280  1000
26  2017      6  t027      _8       3   3760  11280   800
41  2017     10  t042      _8       3   3760  11280   800